//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "form_reasonOfDeath.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm3 *Form3;
//---------------------------------------------------------------------------
__fastcall TForm3::TForm3(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void TForm3::ReasonOfDeath(int type)
{
	switch (type) {

	case 1:
		Label1->Caption = "Верховний жрець церкви став занадто могутнім! Вас звергли.";
		break;
	case 2:
		Label1->Caption = "Церква занепала. Люди не мають більше моралі, а Ви права на трон.";
		break;
	case 3:
		Label1->Caption = "Військові здобули занадто багато влади. У країні гос.переворот.";
		break;
	case 4:
		Label1->Caption = "Армію занадто слабка. Вас захопили сусідні королівства.";
		break;
	case 5:
		Label1->Caption = "Ви все зробили вірно. До вашої зали заходить натовп, але все спокійно, всі задоволені.";
		Label1->Caption += "\nВи більше не король, але вас ще довго пам'ятають, як найкращого з них. ";
		break;
	case 6:
		Label1->Caption = "До вашої зали вірвалися люди. Вас стягує з трону розлючений натовп й витягає на вулицю.";
		Label1->Caption += "\nВи більше не король, а за хвилину ваша голова летить з гільотини. В країні анархія. ";
		break;
	case 7:
		Label1->Caption = "Банкіри.. потвори, скупили майже всю державу. Ви більше не маєте влади.";
		break;
	case 8:
		Label1->Caption = "У вас закінчилися гроші! Країна боржник, а вас продали в угоди сплати боргів.";
		break;
	}
}
