//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "game_rules.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm5 *Form5;
//---------------------------------------------------------------------------
__fastcall TForm5::TForm5(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TForm5::FormCreate(TObject *Sender)
{
	Memo1->Lines->Add("ПРАВИЛА ГРИ У \"МОЛОДОГО КОРОЛЯ\"");
	Memo1->Lines->Add("-> Ви є король, ваша головна ціль - вижити.");
	Memo1->Lines->Add("-> До Вас приходять ваші радники, та про щось вас питають.\n");
	Memo1->Lines->Add("Від вашої відповіді залежить те, як зміниться один з чотирьох основних показників.\n");
	Memo1->Lines->Add("(Релігія, Армія, Гроші, Ставлення до вас народу.)");
	Memo1->Lines->Add("-> По закінченню гри, ви зможете продивитися список королів, що ");
    Memo1->Lines->Add("керували державою(кількість зігранних вами ігор), а також як довго.");
}
//---------------------------------------------------------------------------
